# Арифметика
# "1st program"
print((9.0 ** 0.5) * 5.0)

# "Логика"
# "2nd program"
print((9.99 > 9.98) and (1000.0 != 1000.1))

# "Школьная загадка"
# "3rd program"
print(2 * 2 + 2)  # 6
print(2 * (2 + 2))  # 8
print((2 * 2 + 2) < (2 * (2 + 2)))  # true
print((2 * (2 + 2)) - (2 * 2 + 2))  # 2
print((2 * 2 + 2) == (2 * (2 + 2)))  # false

# "Первый после точки"
# "4th program"
print('123.456')  # дана строка
print(float('123.456'))  # преобразовали в дробное число
print(123.456 * 10,0)  # умножили на 10
print(int(1234.56))
print(1234 % 10)
